NivaldoMattos/uLAB_StandLEDControler/StandLED_PIC18/StandLEDControllerV1.0.X/mcc_generated_files/app.c
//------------------------------------------------------------------------------
// Firmware para controle do LED IX1903b e do WS2812b
// Serve como Bridge RS232/LED enderecavel.
//
// Dev: N.M
// Data: 21/05/2021
// Adicionado repositorio no github
//
// Utilizando codigo inline disparado por interrupcao de timer.
// A configuracao dos LEDs e feita pela usart na velocidade de 115200Kbps
//
// Versaoo de compilador utilizado: Microchip\xc8\v1.41
//
// Formato do pacote de configuracao: 
//  0 a 254 para comandos e valores r g b;
//
//  terminador: 255
//  canal, tipo, posicao, red, green, blue, 255  
//  ShowLed = 1;
//------------------------------------------------------------------------------
#include "app.h"
#include <xc.h>
#include "pin_manager.h"
#include "eusart1.h"
//------------------------------------------------------------------------------
#define MY_RX_BUFFER_SIZE 128
static uint8_t Buffer[MY_RX_BUFFER_SIZE];

// Sao 50 chips enderecaveis em 5 metros da fita de LED IX1903b

# define MAX_LEDS_CH0 7
# define MAX_LEDS_CH1 7
# define MAX_LEDS_CH2 64
# define MAX_LEDS_CH3 64
# define MAX_LEDS_CH4 64
# define MAX_LEDS_CH5 64
# define MAX_LEDS_CH6 64

# define RBG 0
# define GBR 1

static uint8_t CH0[MAX_LEDS_CH0]; 

static uint8_t R0[MAX_LEDS_CH0]; 
static uint8_t G0[MAX_LEDS_CH0]; 
static uint8_t B0[MAX_LEDS_CH0];

static uint8_t R1[MAX_LEDS_CH1]; 
static uint8_t G1[MAX_LEDS_CH1]; 
static uint8_t B1[MAX_LEDS_CH1];

static uint8_t R2[MAX_LEDS_CH2]; 
static uint8_t G2[MAX_LEDS_CH2]; 
static uint8_t B2[MAX_LEDS_CH2];

static uint8_t R3[MAX_LEDS_CH3]; 
static uint8_t G3[MAX_LEDS_CH3]; 
static uint8_t B3[MAX_LEDS_CH3];

static uint8_t R4[MAX_LEDS_CH4]; 
static uint8_t G4[MAX_LEDS_CH4]; 
static uint8_t B4[MAX_LEDS_CH4];

static uint8_t R5[MAX_LEDS_CH5]; 
static uint8_t G5[MAX_LEDS_CH5]; 
static uint8_t B5[MAX_LEDS_CH5];

static uint8_t R6[MAX_LEDS_CH6]; 
static uint8_t G6[MAX_LEDS_CH6]; 
static uint8_t B6[MAX_LEDS_CH6];

static int ShootLedsCh0 = 0;
static int ShootLedsCh1 = 0;
static int ShootLedsCh2 = 0;
static int ShootLedsCh3 = 0;
static int ShootLedsCh4 = 0;
static int ShootLedsCh5 = 0;
static int ShootLedsCh6 = 0;

    static int Idx2, Idx3;

uint8_t Idx = 0;
uint8_t IdxFrame = 0;

bool  ftest = true;

int channel = 0;
int type = RBG;

int ch0_len = 0;
bool send_ch0 = false;



//------------------------------------------------------------------------------
//  Inicializa��o
//------------------------------------------------------------------------------
void AppInitialize(void)
{
    //Habilita INT0
    INTCONbits.INT0IE = 1;
    //INT0 on rising edge
    INTCON2bits.INTEDG0 = 1;
    //ADCON0bits.CHS = 0;  // Ad canal 0
    //ADCON0bits.ADON = 1; // Liga o AD
}


//------------------------------------------------------------------------------
//   AppProcess(void): 
//------------------------------------------------------------------------------
void AppProcess(void){
    while(1){
    
    }
}


/*
//------------------------------------------------------------------------------
// WS2812B
void um(){
    //#Inline code
    LATB0 = 1;
    NOP();NOP();NOP();NOP();NOP();NOP();
    NOP();NOP();NOP();NOP();NOP();NOP();
    LATB0 = 0;
}
void zero(){
    //#inline code
    LATB0 = 1;
    NOP();NOP();NOP();
    LATB0 = 0;
    NOP();NOP();NOP();NOP();NOP();NOP();
}
*/


//------------------------------------------------------------------------------
// Codigo inline para geraco do diagrama de tempos 
// Fita LED com chip IX1903B (um endereco controla 3 LEDs)
// Obs: Refatorar utilizando bloco inline em assembler + ponteiros para
// simplificação do codigo e unificação destas funcoes.
//------------------------------------------------------------------------------
void um_0(){ LATB1 = 1; NOP();NOP();NOP();NOP();NOP();NOP();
             NOP();NOP();NOP();NOP();NOP();NOP();NOP();NOP();NOP(); 
             LATB1 = 0;
}
void zero_0(){ LATB1 = 1; NOP();NOP();NOP();NOP();NOP();NOP();
               LATB1 = 0; NOP();NOP();NOP();NOP();NOP();NOP(); }

/*
//-----------------------------
void um_1(){ LATB1 = 1; NOP();NOP();NOP();NOP();NOP();NOP();
             NOP();NOP();NOP();NOP();NOP();NOP();
             NOP();NOP();NOP(); LATB1 = 0;
}
void zero_1(){ LATB1 = 1; NOP();NOP();NOP();NOP();NOP();NOP();
               LATB1 = 0; NOP();NOP();NOP();NOP();NOP();NOP(); }
//-----------------------------
void um_2(){ LATB2 = 1; NOP();NOP();NOP();NOP();NOP();NOP();
             NOP();NOP();NOP();NOP();NOP();NOP();
             NOP();NOP();NOP(); LATB2 = 0;
}
void zero_2(){ LATB2 = 1; NOP();NOP();NOP();NOP();NOP();NOP();
               LATB2 = 0; NOP();NOP();NOP();NOP();NOP();NOP(); }
//-----------------------------
void um_3(){ LATB3 = 1; NOP();NOP();NOP();NOP();NOP();NOP();
             NOP();NOP();NOP();NOP();NOP();NOP();
             NOP();NOP();NOP(); LATB3 = 0;
}
void zero_3(){ LATB3 = 1; NOP();NOP();NOP();NOP();NOP();NOP();
               LATB3 = 0; NOP();NOP();NOP();NOP();NOP();NOP(); }
//-----------------------------
void um_4(){ LATB4 = 1; NOP();NOP();NOP();NOP();NOP();NOP();
             NOP();NOP();NOP();NOP();NOP();NOP();
             NOP();NOP();NOP(); LATB4 = 0;
}
void zero_4(){ LATB4 = 1; NOP();NOP();NOP();NOP();NOP();NOP();
               LATB4 = 0; NOP();NOP();NOP();NOP();NOP();NOP(); }
//-----------------------------
void um_5(){ LATB5 = 1; NOP();NOP();NOP();NOP();NOP();NOP();
             NOP();NOP();NOP();NOP();NOP();NOP();
             NOP();NOP();NOP(); LATB5 = 0;
}
void zero_5(){ LATB5 = 1; NOP();NOP();NOP();NOP();NOP();NOP();
               LATB5 = 0; NOP();NOP();NOP();NOP();NOP();NOP(); }
//-----------------------------
void um_6(){ LATB5 = 1; NOP();NOP();NOP();NOP();NOP();NOP();
             NOP();NOP();NOP();NOP();NOP();NOP();
             NOP();NOP();NOP(); LATB5 = 0;
}
void zero_6(){ LATB5 = 1; NOP();NOP();NOP();NOP();NOP();NOP();
               LATB5 = 0; NOP();NOP();NOP();NOP();NOP();NOP(); }

*/

void SendBuffCh0(uint8_t idx_color1, uint8_t idx_color2, uint8_t idx_color3){
   //-----------------------------
    if( (CH0[idx_color1] & 128) > 0) um_0();else zero_0();
    if( (CH0[idx_color1] & 64) > 0) um_0();else zero_0();
    if( (CH0[idx_color1] & 32) > 0) um_0();else zero_0();
    if( (CH0[idx_color1] & 16) > 0) um_0();else zero_0();
    if( (CH0[idx_color1] & 8) > 0) um_0();else zero_0();
    if( (CH0[idx_color1] & 4) > 0) um_0();else zero_0();
    if( (CH0[idx_color1] & 2) > 0) um_0();else zero_0();
    if( (CH0[idx_color1] & 1) > 0) um_0();else zero_0();
    //-----------------------------
    if( (CH0[idx_color2] & 128) > 0) um_0();else zero_0();
    if( (CH0[idx_color2] & 64) > 0) um_0();else zero_0();
    if( (CH0[idx_color2] & 32) > 0) um_0();else zero_0();
    if( (CH0[idx_color2] & 16) > 0) um_0();else zero_0();
    if( (CH0[idx_color2] & 8) > 0) um_0();else zero_0();
    if( (CH0[idx_color2] & 4) > 0) um_0();else zero_0();
    if( (CH0[idx_color2] & 2) > 0) um_0();else zero_0();
    if( (CH0[idx_color2] & 1) > 0) um_0();else zero_0();
    //-----------------------------
    if( (CH0[idx_color3] & 128) > 0) um_0();else zero_0();
    if( (CH0[idx_color3] & 64) > 0) um_0();else zero_0();
    if( (CH0[idx_color3] & 32) > 0) um_0();else zero_0();
    if( (CH0[idx_color3] & 16) > 0) um_0();else zero_0();
    if( (CH0[idx_color3] & 8) > 0) um_0();else zero_0();
    if( (CH0[idx_color3] & 4) > 0) um_0();else zero_0();
    if( (CH0[idx_color3] & 2) > 0) um_0();else zero_0();
    if( (CH0[idx_color3] & 1) > 0) um_0();else zero_0();
}


