NivaldoMattos/uLAB_StandLEDControler/StandLED_PIC18/StandLEDControllerV1.0.X/mcc_generated_files/app.c
/*
//------------------------------------------------------------------------------
// Refatorar utilizando ponteiros para unificacao dessas funcoes
//------------------------------------------------------------------------------
void SendBuffCh0(uint8_t idx ){
   //-----------------------------
    if( (G0[idx] & 128) > 0) um_0();else zero_0();
    if( (G0[idx] & 64) > 0) um_0();else zero_0();
    if( (G0[idx] & 32) > 0) um_0();else zero_0();
    if( (G0[idx] & 16) > 0) um_0();else zero_0();
    if( (G0[idx] & 8) > 0) um_0();else zero_0();
    if( (G0[idx] & 4) > 0) um_0();else zero_0();
    if( (G0[idx] & 2) > 0) um_0();else zero_0();
    if( (G0[idx] & 1) > 0) um_0();else zero_0();
    //-----------------------------
    if( (R0[idx] & 128) > 0) um_0();else zero_0();
    if( (R0[idx] & 64) > 0) um_0();else zero_0();
    if( (R0[idx] & 32) > 0) um_0();else zero_0();
    if( (R0[idx] & 16) > 0) um_0();else zero_0();
    if( (R0[idx] & 8) > 0) um_0();else zero_0();
    if( (R0[idx] & 4) > 0) um_0();else zero_0();
    if( (R0[idx] & 2) > 0) um_0();else zero_0();
    if( (R0[idx] & 1) > 0) um_0();else zero_0();
    //-----------------------------
    if( (B0[idx] & 128) > 0) um_0();else zero_0();
    if( (B0[idx] & 64) > 0) um_0();else zero_0();
    if( (B0[idx] & 32) > 0) um_0();else zero_0();
    if( (B0[idx] & 16) > 0) um_0();else zero_0();
    if( (B0[idx] & 8) > 0) um_0();else zero_0();
    if( (B0[idx] & 4) > 0) um_0();else zero_0();
    if( (B0[idx] & 2) > 0) um_0();else zero_0();
    if( (B0[idx] & 1) > 0) um_0();else zero_0();
}



void SendBuffCh1(uint8_t idx ){
   //-----------------------------
    if( (G1[idx] & 128) > 0) um_1();else zero_1();
    if( (G1[idx] & 64) > 0) um_1();else zero_1();
    if( (G1[idx] & 32) > 0) um_1();else zero_1();
    if( (G1[idx] & 16) > 0) um_1();else zero_1();
    if( (G1[idx] & 8) > 0) um_1();else zero_1();
    if( (G1[idx] & 4) > 0) um_1();else zero_1();
    if( (G1[idx] & 2) > 0) um_1();else zero_1();
    if( (G1[idx] & 1) > 0) um_1();else zero_1();
    //-----------------------------
    if( (R1[idx] & 128) > 0) um_1();else zero_1();
    if( (R1[idx] & 64) > 0) um_1();else zero_1();
    if( (R1[idx] & 32) > 0) um_1();else zero_1();
    if( (R1[idx] & 16) > 0) um_1();else zero_1();
    if( (R1[idx] & 8) > 0) um_1();else zero_1();
    if( (R1[idx] & 4) > 0) um_1();else zero_1();
    if( (R1[idx] & 2) > 0) um_1();else zero_1();
    if( (R1[idx] & 1) > 0) um_1();else zero_1();
    //-----------------------------
    if( (B1[idx] & 128) > 0) um_1();else zero_1();
    if( (B1[idx] & 64) > 0) um_1();else zero_1();
    if( (B1[idx] & 32) > 0) um_1();else zero_1();
    if( (B1[idx] & 16) > 0) um_1();else zero_1();
    if( (B1[idx] & 8) > 0) um_1();else zero_1();
    if( (B1[idx] & 4) > 0) um_1();else zero_1();
    if( (B1[idx] & 2) > 0) um_1();else zero_1();
    if( (B1[idx] & 1) > 0) um_1();else zero_1();
}
void SendBuffCh2(uint8_t idx ){
   //-----------------------------
    if( (G2[idx] & 64) > 0) um_2();else zero_2();
    if( (G2[idx] & 128) > 0) um_2();else zero_2();
    if( (G2[idx] & 32) > 0) um_2();else zero_2();
    if( (G2[idx] & 16) > 0) um_2();else zero_2();
    if( (G2[idx] & 8) > 0) um_2();else zero_2();
    if( (G2[idx] & 4) > 0) um_2();else zero_2();
    if( (G2[idx] & 2) > 0) um_2();else zero_2();
    if( (G2[idx] & 1) > 0) um_2();else zero_2();
    //-----------------------------
    if( (R2[idx] & 128) > 0) um_2();else zero_2();
    if( (R2[idx] & 64) > 0) um_2();else zero_2();
    if( (R2[idx] & 32) > 0) um_2();else zero_2();
    if( (R2[idx] & 16) > 0) um_2();else zero_2();
    if( (R2[idx] & 8) > 0) um_2();else zero_2();
    if( (R2[idx] & 4) > 0) um_2();else zero_2();
    if( (R2[idx] & 2) > 0) um_2();else zero_2();
    if( (R2[idx] & 1) > 0) um_2();else zero_2();
    //-----------------------------
    if( (B2[idx] & 128) > 0) um_2();else zero_2();
    if( (B2[idx] & 64) > 0) um_2();else zero_2();
    if( (B2[idx] & 32) > 0) um_2();else zero_2();
    if( (B2[idx] & 16) > 0) um_2();else zero_2();
    if( (B2[idx] & 8) > 0) um_2();else zero_2();
    if( (B2[idx] & 4) > 0) um_2();else zero_2();
    if( (B2[idx] & 2) > 0) um_2();else zero_2();
    if( (B2[idx] & 1) > 0) um_2();else zero_2();
}
void SendBuffCh3(uint8_t idx ){
   //-----------------------------
    if( (G3[idx] & 128) > 0) um_3();else zero_3();
    if( (G3[idx] & 64) > 0) um_3();else zero_3();
    if( (G3[idx] & 32) > 0) um_3();else zero_3();
    if( (G3[idx] & 16) > 0) um_3();else zero_3();
    if( (G3[idx] & 8) > 0) um_3();else zero_3();
    if( (G3[idx] & 4) > 0) um_3();else zero_3();
    if( (G3[idx] & 2) > 0) um_3();else zero_3();
    if( (G3[idx] & 1) > 0) um_3();else zero_3();
    //-----------------------------
    if( (R3[idx] & 128) > 0) um_3();else zero_3();
    if( (R3[idx] & 64) > 0) um_3();else zero_3();
    if( (R3[idx] & 32) > 0) um_3();else zero_3();
    if( (R3[idx] & 16) > 0) um_3();else zero_3();
    if( (R3[idx] & 8) > 0) um_3();else zero_3();
    if( (R3[idx] & 4) > 0) um_3();else zero_3();
    if( (R3[idx] & 2) > 0) um_3();else zero_3();
    if( (R3[idx] & 1) > 0) um_3();else zero_3();
    //-----------------------------
    if( (B3[idx] & 128) > 0) um_3();else zero_3();
    if( (B3[idx] & 64) > 0) um_3();else zero_3();
    if( (B3[idx] & 32) > 0) um_3();else zero_3();
    if( (B3[idx] & 16) > 0) um_3();else zero_3();
    if( (B3[idx] & 8) > 0) um_3();else zero_3();
    if( (B3[idx] & 4) > 0) um_3();else zero_3();
    if( (B3[idx] & 2) > 0) um_3();else zero_3();
    if( (B3[idx] & 1) > 0) um_3();else zero_3();
}
void SendBuffCh4(uint8_t idx ){
   //-----------------------------
    if( (G4[idx] & 128) > 0) um_4();else zero_4();
    if( (G4[idx] & 64) > 0) um_4();else zero_4();
    if( (G4[idx] & 32) > 0) um_4();else zero_4();
    if( (G4[idx] & 16) > 0) um_4();else zero_4();
    if( (G4[idx] & 8) > 0) um_4();else zero_4();
    if( (G4[idx] & 4) > 0) um_4();else zero_4();
    if( (G4[idx] & 2) > 0) um_4();else zero_4();
    if( (G4[idx] & 1) > 0) um_4();else zero_4();
    //-----------------------------
    if( (R4[idx] & 128) > 0) um_4();else zero_4();
    if( (R4[idx] & 64) > 0) um_4();else zero_4();
    if( (R4[idx] & 32) > 0) um_4();else zero_4();
    if( (R4[idx] & 16) > 0) um_4();else zero_4();
    if( (R4[idx] & 8) > 0) um_4();else zero_4();
    if( (R4[idx] & 4) > 0) um_4();else zero_4();
    if( (R4[idx] & 2) > 0) um_4();else zero_4();
    if( (R4[idx] & 1) > 0) um_4();else zero_4();
    //-----------------------------
    if( (B4[idx] & 128) > 0) um_4();else zero_4();
    if( (B4[idx] & 64) > 0) um_4();else zero_4();
    if( (B4[idx] & 32) > 0) um_4();else zero_4();
    if( (B4[idx] & 16) > 0) um_4();else zero_4();
    if( (B4[idx] & 8) > 0) um_4();else zero_4();
    if( (B4[idx] & 4) > 0) um_4();else zero_4();
    if( (B4[idx] & 2) > 0) um_4();else zero_4();
    if( (B4[idx] & 1) > 0) um_4();else zero_4();
}
void SendBuffCh5(uint8_t idx ){
   //-----------------------------
    if( (G5[idx] & 128) > 0) um_5();else zero_5();
    if( (G5[idx] & 64) > 0) um_5();else zero_5();
    if( (G5[idx] & 32) > 0) um_5();else zero_5();
    if( (G5[idx] & 16) > 0) um_5();else zero_5();
    if( (G5[idx] & 8) > 0) um_5();else zero_5();
    if( (G5[idx] & 4) > 0) um_5();else zero_5();
    if( (G5[idx] & 2) > 0) um_5();else zero_5();
    if( (G5[idx] & 1) > 0) um_5();else zero_5();
    //-----------------------------
    if( (R5[idx] & 128) > 0) um_5();else zero_5();
    if( (R5[idx] & 64) > 0) um_5();else zero_5();
    if( (R5[idx] & 32) > 0) um_5();else zero_5();
    if( (R5[idx] & 16) > 0) um_5();else zero_5();
    if( (R5[idx] & 8) > 0) um_5();else zero_5();
    if( (R5[idx] & 4) > 0) um_5();else zero_5();
    if( (R5[idx] & 2) > 0) um_5();else zero_5();
    if( (R5[idx] & 1) > 0) um_5();else zero_5();
    //-----------------------------
    if( (B5[idx] & 128) > 0) um_5();else zero_5();
    if( (B5[idx] & 64) > 0) um_5();else zero_5();
    if( (B5[idx] & 32) > 0) um_5();else zero_5();
    if( (B5[idx] & 16) > 0) um_5();else zero_5();
    if( (B5[idx] & 8) > 0) um_5();else zero_5();
    if( (B5[idx] & 4) > 0) um_5();else zero_5();
    if( (B5[idx] & 2) > 0) um_5();else zero_5();
    if( (B5[idx] & 1) > 0) um_5();else zero_5();
}
void SendBuffCh6(uint8_t idx ){
   //-----------------------------
    if( (G6[idx] & 128) > 0) um_6();else zero_6();
    if( (G6[idx] & 64) > 0) um_6();else zero_6();
    if( (G6[idx] & 32) > 0) um_6();else zero_6();
    if( (G6[idx] & 16) > 0) um_6();else zero_6();
    if( (G6[idx] & 8) > 0) um_6();else zero_6();
    if( (G6[idx] & 4) > 0) um_6();else zero_6();
    if( (G6[idx] & 2) > 0) um_6();else zero_6();
    if( (G6[idx] & 1) > 0) um_6();else zero_6();
    //-----------------------------
    if( (R6[idx] & 128) > 0) um_6();else zero_6();
    if( (R6[idx] & 64) > 0) um_6();else zero_6();
    if( (R6[idx] & 32) > 0) um_6();else zero_6();
    if( (R6[idx] & 16) > 0) um_6();else zero_6();
    if( (R6[idx] & 8) > 0) um_6();else zero_6();
    if( (R6[idx] & 4) > 0) um_6();else zero_6();
    if( (R6[idx] & 2) > 0) um_6();else zero_6();
    if( (R6[idx] & 1) > 0) um_6();else zero_6();
    //-----------------------------
    if( (B6[idx] & 128) > 0) um_6();else zero_6();
    if( (B6[idx] & 64) > 0) um_6();else zero_6();
    if( (B6[idx] & 32) > 0) um_6();else zero_6();
    if( (B6[idx] & 16) > 0) um_6();else zero_6();
    if( (B6[idx] & 8) > 0) um_6();else zero_6();
    if( (B6[idx] & 4) > 0) um_6();else zero_6();
    if( (B6[idx] & 2) > 0) um_6();else zero_6();
    if( (B6[idx] & 1) > 0) um_6();else zero_6();
}
*/

//------------------------------------------------------------------------------
// 
//------------------------------------------------------------------------------
void SetLED(uint8_t channel, uint8_t type, uint8_t led, uint8_t color1, uint8_t color2, uint8_t color3){
    
    uint8_t red, green, blue;
             
    if(type == 0){  // Algumas fitas tem o a sequencia RGB invertidas... LEDs inferior Tampa ok.
        red = color2;
        green = color1;
        blue = color3;
    }
    else if(type==1){
        red = color1;
        green = color3;
        blue = color2;
    }
    
    //-----------------
    if(channel == 0){
        R0[led]=red;
        G0[led]=green;
        B0[led]=blue;
    }
    
