NivaldoMattos/uLAB_StandLEDControler/StandLED_PIC18/StandLEDControllerV1.0.X/mcc_generated_files/app.c
    /*
    else if(channel == 1){
        R1[led]=red;
        G1[led]=green;
        B1[led]=blue;
    }
    else if(channel == 2){
        R2[led]=red;
        G2[led]=green;
        B2[led]=blue;
    }
    else if(channel == 3){
        R3[led]=red;
        G3[led]=green;
        B3[led]=blue;
    }
    else if(channel == 4){
        R4[led]=red;
        G4[led]=green;
        B4[led]=blue;
    }
    else if(channel == 5){
        R5[led]=red;
        G5[led]=green;
        B5[led]=blue;
    }
     
    */
     
}


//------------------------------------------------------------------------------
// Rotima de teste dos LEDs (1 x na inicializa��o))
//------------------------------------------------------------------------------
void TestLEDs(){  
}
//------------------------
void AppTimer1s(){
}   
//------------------------
// Interrompe a cada 100ms
//------------------------
void AppTimer100ms(){
}
//------------------------
// Interrompe a cada 10ms
//------------------------
void AppTimer10ms(){
    
    /*
    static int cnt=0;
    
    if(send_ch0){
        if(cnt<ch0_len){
            EUSART1_Write(CH0[cnt]);
            cnt++;
        }
        else {
            cnt=0;
            send_ch0 = false;
        }
    }
     * 
     */
    
     
}
//------------------------
// Interrompe a cada 1ms
//------------------------
void AppTimer1ms(){
    
    if(ShootLedsCh0 == 1){
        for(Idx=0; Idx < ch0_len; Idx+=3){
            SendBuffCh0(Idx, Idx+1, Idx+2);
        }
        ShootLedsCh0 = 0;
    }
    
    /*
    
    if(ShootLedsCh1 == 1){
        for(Idx=0; Idx < MAX_LEDS_CH1; Idx++)
            SendBuffCh1(Idx);
        ShootLedsCh1 = 0;
    }
    if(ShootLedsCh2 == 1){
        for(Idx=0; Idx < MAX_LEDS_CH2; Idx++)
            SendBuffCh2(Idx);
        ShootLedsCh2 = 0;
    }
    if(ShootLedsCh3 == 1){
        for(Idx=0; Idx < MAX_LEDS_CH3; Idx++)
            SendBuffCh3(Idx);
        ShootLedsCh3 = 0;
    }
    if(ShootLedsCh4 == 1){
        for(Idx=0; Idx < MAX_LEDS_CH4; Idx++)
            SendBuffCh4(Idx);
        ShootLedsCh4 = 0;
    }
    if(ShootLedsCh5 == 1){
        for(Idx=0; Idx < MAX_LEDS_CH5; Idx++)
            SendBuffCh5(Idx);
        ShootLedsCh5 = 0;
    }
    if(ShootLedsCh6 == 1){
        for(Idx=0; Idx < MAX_LEDS_CH6; Idx++)
            SendBuffCh6(Idx);
        ShootLedsCh6 = 0;
    }
     * 
     * 
     */
}    


//------------------------------------------------------------------------------
// Interrup��o do tmr0  pr�ximo a 32.55uS.
//------------------------------------------------------------------------------
void AppTimer30us(void)  {
    static int count1ms = 4;
    static int count10ms = 9;
    static int count100ms = 9;
    static int count1000ms = 9;
   
    //---------------------------
    if (count1ms > 0) count1ms--;
    else {
        count1ms = 33; //33
        AppTimer1ms();
        if (count10ms > 0)count10ms--;
        else {
            count10ms = 9;
            AppTimer10ms();
            if (count100ms > 0)count100ms--;
            else {
                count100ms = 9;
                AppTimer100ms();
                if (count1000ms > 0)count1000ms--;
                else {
                    count1000ms = 9;
                    AppTimer1s();
                }
            }
        }
    }       

}

//------------------------------------------------------------------------------
// Interrupcao de recepcao serial
// Formato de pacote de entrada:
//          preamb chann type len_pay strt_pay dt0 dt1    dtn
// DadosRx = [85,    1,    1,    8,      254,   1,  2...  11]
//------------------------------------------------------------------------------
void AppINT_USART1_RX(unsigned char rxData)
{    

    static int len_package = 0;
    static bool capturando = false;
    
    EUSART1_Write(Idx3);
    
    if(capturando){
        CH0[Idx3] = rxData; 
        
        if(Idx2 > len_package){  //
            capturando=false;
            Idx2 = 0;
            Idx3 = 0;
            //send_ch0 = true;
            ShootLedsCh0 = 1;
       }
    }
    
    Buffer[Idx2]= rxData;
    if(Buffer[Idx2] == 254 && !capturando){
        if(Buffer[Idx2-4]== 85){
            len_package= Buffer[Idx2-1];
            ch0_len = len_package; 
            type= Buffer[Idx2-2];
            channel= Buffer[Idx2-3];
            capturando = true;
            Idx2 = 2;  //2
            Idx3 = 0;
        }
    }
    else{
       Idx2++;
    }
    if(capturando)
       Idx3++;
    
}
 
//------------------------------------------------------------------------------
// Interrupcao de recepcao serial

// pacote com 7  bytes:
// canal(0-5) Type(0-1) led(0-N) red_val(0-254) green_val(0-254) blue_val(0-254) end_code(255)
// Frmt:  0       0     1        10                 0             10               255

// Pacote com2 bytes:
// cmd(0-10)  end_code(255)
// Frmt:  0      255
//------------------------------------------------------------------------------
/*
void AppINT_USART1_RX(unsigned char rxData)
{    
    uint8_t channel, pos, red, green, blue, cmd , type, c;
    EUSART1_Write(rxData);
    Buffer[Idx]= rxData;
    
    static int data_cnt;
    data_cnt++;
    
    if(Buffer[Idx] == 255){ 
       
        if(data_cnt==7){       // Pacote com 5 cmds + end_code
           
            channel = Buffer[Idx-6];
            type = Buffer[Idx-5];
            pos = Buffer[Idx-4];        
            red= Buffer[Idx-3];
            green = Buffer[Idx-2];
            blue = Buffer[Idx-1];

            Idx = 0;
            
            SetLED(channel, type, pos, red, green, blue); 

            if(channel==0)  ShootLedsCh0 = 1;
            else if(channel==1)  ShootLedsCh1 = 1;
            else if(channel==2)  ShootLedsCh2 = 1;
            else if(channel==3)  ShootLedsCh3 = 1;
            else if(channel==4)  ShootLedsCh4 = 1;
            else if(channel==5)  ShootLedsCh5 = 1;          
            IdxFrame = 0;
            
            data_cnt=0; 
            
        }
        if(data_cnt==2){       // Pacote com 1 cmd + end_code
            
           cmd = Buffer[Idx-1];      
           Idx = 0;
           
           if(cmd==0){ 
                LED_Toggle();
                for(int c=0; c< 50; c++){
                    SetLED(0, RBG, c, 10 , 0 , 0); // Fita Tampo menor
                    SetLED(1, GBR, c, 10 , 0 , 0); // Fita ainda nao utilizada
                }
                ShootLedsCh0 = 1;
                ShootLedsCh1 = 1;
           }
           else if(cmd==1){   
                LED_Toggle();
                for(int c=0; c< 50; c++){
                    SetLED(0, RBG, c, 0 , 10 , 0);
                    SetLED(1, GBR, c, 0 , 10 , 0);
                }
                ShootLedsCh0 = 1;
                ShootLedsCh1 = 1;
           }
           else if(cmd==2){  
                LED_Toggle();
                for(int c=0; c< 50; c++){
                    SetLED(0, RBG, c, 0 , 0 , 10);
                    SetLED(1, GBR, c, 0 , 0 , 10);
                }
                ShootLedsCh0 = 1;
                ShootLedsCh1 = 1;
           }
           
           data_cnt=0; 
        }    
    }
    else  
      Idx += 1;
}
  */
//------------------------------------------------------------------------------
//End of File
//--------------